src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	
	Движения.ВКМ_ДополнительныеНачисления.Очистить();
	Движения.ВКМ_Удержания.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	// 2. Формирование движений по начислениям и удержаниям
    Для Каждого СтрокаТЧ Из СписокСотрудников Цикл
        
        // Запись премии
        ДвижениеНачисление = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        ДвижениеНачисление.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
        ДвижениеНачисление.Сотрудник = СтрокаТЧ.Сотрудник;
        ДвижениеНачисление.ПериодРегистрации = ПериодРегистрации;
        ДвижениеНачисление.Результат = СтрокаТЧ.СуммаПремии;
        
        // Запись НДФЛ
        ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
        ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        ДвижениеУдержание.Сотрудник = СтрокаТЧ.Сотрудник;
        ДвижениеУдержание.ПериодРегистрации = ПериодРегистрации;
        ДвижениеУдержание.Результат = СтрокаТЧ.СуммаПремии * 0.13;
        
        // 3. Формирование взаиморасчетов 
        ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеВзаиморасчеты.Период      = Дата;
        ДвижениеВзаиморасчеты.Сотрудник   = СтрокаТЧ.Сотрудник;
        ДвижениеВзаиморасчеты.Сумма       = СтрокаТЧ.СуммаПремии * 0.87; 
        
    КонецЦикла;
    
    Движения.Записать();
	
КонецПроцедуры
